 gdb .\problem01.exe
GNU gdb (GDB) 7.6.1
Copyright (C) 2013 Free Software Foundation, Inc.
License GPLv3+: GNU GPL version 3 or later <http://gnu.org/licenses/gpl.html>
This is free software: you are free to change and redistribute it.
There is NO WARRANTY, to the extent permitted by law.  Type "show copying"
and "show warranty" for details.
This GDB was configured as "mingw32".
For bug reporting instructions, please see:
<http://www.gnu.org/software/gdb/bugs/>...
Reading symbols from C:\Users\ashwini\PSC\c-activity-sets-1\set01\problem01.exe...done.
(gdb) r
Starting program: C:\Users\ashwini\PSC\c-activity-sets-1\set01/.\problem01.exe 
[New Thread 12824.0x1fe8]
[New Thread 12824.0x8314]
Arvindraj[Inferior 1 (process 12824) exited normally]
(gdb) q
gdb .\problem01.exe
GNU gdb (GDB) 7.6.1
Copyright (C) 2013 Free Software Foundation, Inc.
License GPLv3+: GNU GPL version 3 or later <http://gnu.org/licenses/gpl.html>
This is free software: you are free to change and redistribute it.
There is NO WARRANTY, to the extent permitted by law.  Type "show copying"
and "show warranty" for details.
This GDB was configured as "mingw32".
For bug reporting instructions, please see:
<http://www.gnu.org/software/gdb/bugs/>...
Reading symbols from C:\Users\ashwini\PSC\c-activity-sets-1\set01\problem01.exe...done.
(gdb) r
Starting program: C:\Users\ashwini\PSC\c-activity-sets-1\set01/.\problem01.exe 
[New Thread 12824.0x1fe8]
[New Thread 12824.0x8314]
Arvindraj[Inferior 1 (process 12824) exited normally]
(gdb) q
PS C:\Users\ashwini\PSC\c-activity-sets-1\set01> gdb .\problem01.exe
GNU gdb (GDB) 7.6.1
Copyright (C) 2013 Free Software Foundation, Inc.
License GPLv3+: GNU GPL version 3 or later <http://gnu.org/licenses/gpl.html>
This is free software: you are free to change and redistribute it.
There is NO WARRANTY, to the extent permitted by law.  Type "show copying"
and "show warranty" for details.
This GDB was configured as "mingw32".
For bug reporting instructions, please see:
<http://www.gnu.org/software/gdb/bugs/>...
Reading symbols from C:\Users\ashwini\PSC\c-activity-sets-1\set01\problem01.exe...done.
(gdb) b main
Breakpoint 1 at 0x40146e: file problem01.c, line 4.
(gdb) r
Starting program: C:\Users\ashwini\PSC\c-activity-sets-1\set01/.\problem01.exe
[New Thread 36196.0x6f3c]
[New Thread 36196.0x8ce4]

Breakpoint 1, main () at problem01.c:4
4           printf("Arvindraj");
(gdb) n
Arvindraj5          return 0;
(gdb) c                        
Continuing.
[Inferior 1 (process 36196) exited normally]
(gdb) q